<template>
  <div>
    <HeadTitle class="mb-4" />
    <h4 dir="rtl" class="text-center mt-5 mb-3">{{ title }}</h4>
    <div>
      <img class="infoImage" :src="image" alt="Not Loaded">
      <div class="text-right m-auto tabFix">
        <template>
          <el-tabs v-model="activeName" @tab-click="handleClick">
            <el-tab-pane label="کامنت ها" name="first">
              <div dir="rtl" class="p-3">
                <p class="comments-fix">{{ firstComment }}</p>
                <p class="comments-fix">{{ secondComment }}</p>
                <p class="comments-fix">{{ thirdComment }}</p>
              </div>
            </el-tab-pane>
            <el-tab-pane label="معرفی محصول" name="second">
              <p class="description">
                {{ description }}
              </p>
            </el-tab-pane>
          </el-tabs>
        </template>
      </div>
    </div>
    <div class="text-center mt-3 d-md-none">
      <img class="footerImg" :src="image" alt="Not Loaded">
    </div>
    <Footer class="mb-4" />
  </div>
</template>

<script>
import 'assets/css/info.css'
export default {
  data() {
    return {
      activeName: 'second',
      image: ``,
      description: ``,
      title: ``,
      firstComment: ``,
      secondComment: ``,
      thirdComment: ``,

      mobInfo: [
        {
          id: 1, image: '/images/mobile1.jpg', title: 'گوشی موبایل اپل مدل iPhone 13 Pro ZA/A Active دو سیم کارت ظرفیت 256 گیگابایت - رم 6 گیگابایت', description: 'بدون هیچ تعریف اضافی باید بگوییم که iPhone 13 Pro Max یکی از قدرتمند‌ترین گوشی‌های هوشمند پرچمدار موجود در بازار است که توانست رکوردهای جدیدی را به نام خودش ثبت کند. این گوشی به صفحه‌نمایش 6.7 اینچ و رزولوشن 2778x1284 با توانایی نمایش 458 پیکسل در هر اینچ، نرخ بروزرسانی 120 هرتز، حداکثر روشنایی 1200 نیت (nits)، تمام هرآنچه از یک صفحه‌نمایش باکیفیت توقع دارید را در اختیارتان می‌گذارد. در قسمت پشتی سه سنسور دوربین به همراه یک سنسور LIDAR با همان طراحی آیفون 12 پرو مکس قرار گرف ...', firstComment: 'با سلام، با توجه به اینکه گوشی خیلی خوبیه حافظه 512 موجود کنید.', secondComment: 'با سلام و احترام سال پیش از سایت شما خرید کردم و از نظر کیفیت و قیمت خیلی راضی بودم.', thirdComment: 'اخیرا خیلی گرون میدین! چه خبره طی دو روز گذشته ده بار قیمت این گوشی افزایش داشته!'
        },
        {
          id: 2, image: '/images/mobile2.jpg', title: 'گوشی موبایل سامسونگ مدل Galaxy A33 5G SM-A336 دو سیم کارت ظرفیت 128 گیگابایت و رم 6 گیگابایت', description: 'گوشی‌های هوشمند میان‌رده سری A سامسونگ در بین کاربران طرفداران بسیاری دارند و تا به امروز هم توانسته‌اند با بهره بردن از مشخصات فنی مناسب، عملکرد بسیار خوب و قابل قبولی را ارائه کنند. یکی از گوشی‌های میان‌رده با‌کیفیت این شرکت که در سال ۲۰۲۲ معرفی شد، سامسونگ Galaxy A33 5G  که در جایگاه یک گوشی میان‌رده، از مشخصات فنی مناسب و حتی قدرتمندی بهره برده است. سامسونگ بار دیگر زبان طراحی آشنایی خود برای گوشی‌های هوشمند میان‌رده را برای Galaxy A33 5G در نظر گرفته است. طراحی که شاید بسیار  برای شما آشنا باشد اما باز هم نمی‌توان از کنار طراحی کاربرد پسند آن به‌راحتی عبور کرد. در نمای رو‌به‌رویی صفحه‌نمایش یکدستی را شاهد هستیم که به بریدگی ناچ اینفینیتی V یا همان واتردراپ مجهز شده است. بریدگی قطره‌ای شکلی که در قسمت بالایی و مرکزی صفحه‌نمایش، سنسور دوربین سلفی را در خود جای داده است. به نسبت ابعاد صفحه‌نمایش، باید بگوییم که حاشیه‌های مناسبی برایش در نظر گرفته شده که هرچند شاید بهتر بود برای قسمت پایینی صفحه‌نمایش حاشیه کمتری در نظر گرفته می‌شد اما در مجموع با توجه به اینکه ۸۳.۷ درصد از نمای رو‌به‌رویی را صفحه‌نمایش به خودش اختصاص داده است، می‌توان در این بخش نمره قبولی را به سامسونگ Galaxy A33 5G داد.', firstComment: 'زمان تحویل عالی بود', secondComment: 'تا الان که خوب و عالی بوده و حتما توصیه میکنم', thirdComment: 'میگن صفحه نمایش همیشه روشن داره ولی ساعت و نمیشه رو تم اون گزاشت درآ یا نه با آپدیت حل نمیشه'
        },
        {
          id: 3, image: '/images/mobile3.jpg', title: 'گوشی موبایل سامسونگ مدل Galaxy A73 5G SM-A736B/DS دو سیم کارت ظرفیت 128 گیگابایت', description: 'برخی از گوشی‌های هوشمند میان‌رده از مشخصات فنی قدرتمندی بهره برده‌اند که در برخی از موارد مشخصات فنی در نظر گرفته شده، چیزی کم از یک پرچمدار ندارند. سامسونگ Galaxy A73 5G SM-A736B/DS هم یکی از این گوشی‌های هوشمند میان‌رده با‌کیفیت موجود در بازار است که به لطف بهره بردن از مشخصات فنی قدرتمند، توانایی ارائه عملکرد بسیار خوبی را دارد. در نمای رو‌به‌رویی این گوشی به صفحه‌نمایش با ابعاد 6.7 اینچ و رزولوشن 1080×2400 پیکسل از نوع سوپرامولد‌ پلاس مجهز شده است. صفحه‌نمایشی با توانایی ...', firstComment: 'بسیار عالی پلمپ.بسته بندی عالی .ارسال سریع', secondComment: 'گوشی a73گرفتم راضی هستم', thirdComment: 'فعلا همه چیز خوب به نظر میاد'
        },
        {
          id: 4, image: '/images/mobile4.jpg', title: 'گوشی موبایل رنسو مدل Nep N9 Pro 5G دو سیم کارت ظرفیت 256 گیگابایت و رم 12 گیگابایت', description: 'گوشی های هوشمند، امروزه به ضروری ترین ابزار های زندگی روزمره تبدیل شده اند. شاید خرید لپ تاپ امری مستلزم زمان، تحقیق و هزینه کر بیشتری باشد اما گوشی موبایل این روزها تبدیل به کالای ضروری شده است.  این گوشی ها که از سیستم عامل های مختلفی بهره می برند، قادر هستند تمامی نیاز های روزانه کاربران را به خوبی برطرف نمایند و امکانات مختلفی نظیر اتصال به اینترنت، دیدن فیلم و سریال وغیره را برای کاربران فراهم آورند. در ادامه با ما همراه باشید تا فاکتور های مهم قبل از خرید گوشی های هوشمند را بررسی کرده تا بتوانید مناسب ترین انتخاب را برای خرید داشته باشید.', firstComment: 'کیفیت عالی طراحی عالی وزن سبک', secondComment: 'گوشی خوبیه من راضیم', thirdComment: 'گوشی خوبی نسبت به s21fe'
        },
        {
          id: 5, image: '/images/mobile5.jpg', title: 'گوشی موبایل اپل مدل iPhone 13 Pro Max LLA تک سیم‌ کارت ظرفیت 128 گیگابایت و رم 6 گیگابایت', description: 'بدون هیچ تعریف اضافی باید بگوییم که iPhone 13 Pro Max یکی از قدرتمند‌ترین گوشی‌های هوشمند پرچمدار موجود در بازار است که توانست رکوردهای جدیدی را به نام خودش ثبت کند. این گوشی به صفحه‌نمایش 6.7 اینچ و رزولوشن 2778x1284 با توانایی نمایش 458 پیکسل در هر اینچ، نرخ بروزرسانی 120 هرتز، حداکثر روشنایی 1200 نیت (nits)، تمام هرآنچه از یک صفحه‌نمایش باکیفیت توقع دارید را در اختیارتان می‌گذارد. در قسمت پشتی سه سنسور دوربین به همراه یک سنسور LIDAR با همان طراحی آیفون 12 پرو مکس قرار گرف ...', firstComment: 'عالی حتی از عکس گوشی معلومه', secondComment: 'بی نظیر بی نقص ارزش خرید دارد', thirdComment: 'عالی و سالم بسیار خوب با بسته سالم با تشکر از دیجی کالا'
        },
        {
          id: 6, image: '/images/mobile6.jpg', title: 'گوشی موبایل سامسونگ مدل Galaxy S23 Ultra ظرفیت 256 گیگابایت و رم 12 گیگابایت', description: 'سامسونگ Galaxy S23 Ultra به‌عنوان گل سرسبد گوشی‌های هوشمند خانواده S23 با بهره بردن از مشخصات فنی قدرتمند معرفی شد. در نگاه اول از نظر طراحی در نظر گرفته شده، سامسونگ Galaxy S23 Ultra به نسبت نسل قبلی یعنی Galaxy S22 Ultra تغییرات زیادی نداشته و تقریبا هر دو گوشی از طراحی مشابهی بهره بردند. اما باید بدانید که Galaxy S23 Ultra به نسبت نسل قبلی، قدرتمند‌تر از همیشه وارد میدان رقابت شده است. در نمای رو‌به‌رویی این گوشی به صفحه‌نمایش شگفت‌انگیز با ابعاد 6.8 اینچ و رزولوشن 1440×30', firstComment: 'در مجموع گوشی خوبیه و ارزش خرید داره', secondComment: 'گوشی خوبیه راضیم ازش مخصوصا دوربین عالی داره فقط باتریش خیلی ضعیفه', thirdComment: 'آیفون خیلی خوب اما نه برای ایران سامسونگ عالی برای همه دنیا به جز آمریکا'
        },
        {
          id: 7, image: '/images/mobile7.jpg', title: 'گوشی موبایل شیائومی مدل Redmi Note 9 ظرفیت 256 گیگابایت رم 8 گیگابایت', description: 'نسل نهم از گوشی‌های Redmi Note خود را معرفی کرده است. گوشی « Redmi Note 9 » مانند نسخه‌های قبلی این سری از گوشی‌ موبایل شیائومی از صفحه‌نمایش بزرگ، باتری پرقدرت، طراحی جذاب دوربین و سخت‌افزار مناسب برای اجرای بازی برخوردار است. این گوشی بدون فناوری NFC وارد بازار شده است. هم با پنل IPS LCD ساخته‌شده و فاصله لبه صفحه‌نمایش در آن بسیار کم است. این نمایشگر 6.53 اینچی حدود 395 پیکسل را در هر اینچ جا داده است. بدنه و نمایشگر این محصول با استفاده از Corning Gorilla Glass 5 محافظت م ...', firstComment: 'بین سه گوشی که همین مدل رو برای اطرافیان و همسرم خریدم یکیش یک مقدا اذیت میکرد ولی در کل گوشی خوبیه', secondComment: 'گوشی خوبیه راضی بودم', thirdComment: 'بعد از یکسال هنگیش اذیت میکنه'
        },
        {
          id: 8, image: '/images/mobile8.jpg', title: 'گوشی موبایل شیائومی مدل 12T Pro دو سیم کارت ظرفیت 256 گیگابایت و رم 8 گیگابایت', description: 'شیائومی از بهترین کمپانی‌ها در زمینه تولید وسایل الکترونیکی و حتی غیر الکترونیکی در جهان است که اکثر کاربران با آن آشنایی دارند و حداقل تابه‌حال یکی از محصولات این برند را خریداری کرده‌اند؛ گوشی‌های شیائومی معمولاً قیمت مناسبی دارند و در قبال آن، سخت‌افزار خوبی هم ارائه می‌دهند که  موردپسند کاربران قرار می‌گیرند. جدیدترین گوشی شیائومی که از بهترین آن ها است و در دسته پرچمدارها قرار می گیرد، شیائومی 12 پرو  نام دارد؛ این گوشی در حقیقت تجمع قطعات خوب و باکیفیت حال حاضر بازار است، پردازنده اسنپدراگون قدرتمند و جدید، نمایشگر فوق‌العاده، دوربین 3 گانه باکیفیت و دیگر ویژگی ها که استفاده از این گوشی شیائومی را لذت بخش می کنند. در ادامه به بررسی این گوشی جدید یعنی شیائومی 12 Pro می پردازیم؛ همراه ما باشید. قیمت شیائومی 12 پرو 256 گیگابایت با رم 12 را در بالای همین صفحه مشاهده کردید.', firstComment: 'همه چی عالی ولی باطری این گوشی افتضاحه . افتضاح. روزی 3 بار باید بزنین به شارژ', secondComment: 'سلام وقت بخیر. بستگی به کارکردتون داره ولی در کل شیائومی ۱۲ پرو انتخاب مناسب‌تری به نظر می‌رسه', thirdComment: 'سلام وقتتون بخیر. شیائومی ۱۲ پرو پردازنده بهتری داره'
        },
        {
          id: 9, image: '/images/mobile9.jpg', title: 'گوشی موبایل اوپو مدل A55 دو سیم کارت ظرفیت 128 گیگابایت و رم 4 گیگابایت', description: 'گوشی‌های میان‌رده شرکت اوپو توانسته‌اند با بهره بردن از مشخصات فنی مناسب، عملکرد بسیار خوبی را به‌نمایش بگذارند. اوپو A55 هم یکی از این گوشی‌های با‌کیفیت است که به نسبت قیمت در نظر گرفته شده، توانایی ارائه عملکرد بسیار خوب و کاملا قابل قبولی را در جایگاه یک گوشی میان‌رده دارد. در نمای رو‌به‌رویی این گوشی به صفحه‌نمایش با ابعاد 6.51 اینچ و رزولوشن 720×1600 پیکسل از نوع IPS مجهز شده که توانایی نمایش 270 پیکسل در هر اینچ و حداکثر روشنایی 550 نیت را دارد که در نهایت وضوح تصویر خو ...', firstComment: 'گوشی کار راه بنداز', secondComment: 'این کوشی از نظر دوربین کیفیت خوبی ندارد', thirdComment: 'گوشی خوبیه ولی انتظار کارکرد عالی نداشته باشید'
        },
        {
          id: 10, image: '/images/mobile10.jpg', title: 'گوشی موبایل نوکیا مدل G11 Plus دو سیم کارت ظرفیت 64 گیگابایت و رم 4 گیگابایت', description: 'اگر به دنبال خرید گوشی‌ هوشمند میان‌رده مقرون به‌صرفه‌ای هستید، گوشی‌های برند نوکیا می‌توانند گزینه‌های بسیار خوبی برای شما باشند. نوکیا G11 Plus هم یکی از این گوشی‌های میان‌رده است که به نسبت قیمت در نظر گرفته شده، از مشخصات فنی مناسب و قابل قبولی بهره برده است. صفحه‌نمایش 6.52 اینچ با رزولوشن 720×1600 پیکسل از نوع IPS، وضوح تصویر قابل قبولی دارد و پشتیبانی از نرخ بروزرسانی 90 هرتز سبب شده تا با صفحه‌نمایشی روان و بدون لگ رو‌به‌رو باشید. درست است که این گوشی از داشتن سنسور', firstComment: 'قدرتمندترین گوشی‌ تا ۵ میلیون', secondComment: 'به نظر میتونه خوب باشه', thirdComment: 'گوشی خوش دست و خوبیه قیمت نسبت به مشخصات گوشی'
        },
      ]
    }
  },
  methods: {
    handleClick(tab, event) {
      console.log(tab, event);
    },

    filterIt(arr, id) {
      // alert(id)
      return arr.find(x => x.id === id);

    }
  },
  mounted() {
    let array = this.filterIt(this.mobInfo, parseInt(this.$route.params.id))
    // console.log(array.description)
    this.image = array.image
    this.description = array.description
    this.title = array.title
    this.firstComment = array.firstComment
    this.secondComment = array.secondComment
    this.thirdComment = array.thirdComment
  }
}
</script>

<style>

</style>