<template>
    <div>
        <HeadTitle/>
        <div class="text-center mt-5 mb-5">
            <h2>
                فروشگاه اینترنتی دیجی کالا، بررسی، انتخاب و خرید آنلاین
            </h2>
            <p class="mt-4 text-right" dir="rtl" style="padding: 40px 120px;">
                دیجی‌کالا (نوآوران فن‌آوازه) در سال ۱۳۸۵ با سرمایه اولیه بسیار محدود به عنوان پلتفرم خرده فروشی آنلاین آغاز به کار کرد و در طول ۱۶ سال با ورود به مدل‌های کسب‌وکار جدید، فراتر از یک شرکت خرده فروشی آنلاین عمل کرد و اکوسیستم تجارت الکترونیک خود را در قالب گروه دیجی‌کالا توسعه داد. تا اواسط سال ۱۴۰۰، دیجی‌کالا به‌عنوان بزرگترین شرکت عملیاتی گروه، در جایگاه شرکت هلدینگ نیز فعالیت می‌کرد و سایر شرکت‌های عملیاتی گروه که در مراحل مختلف رشد قرار داشتند زیر مجموعه این شرکت بودند.

در تیر ماه ۱۴۰۰ شرکت گروه تجارت الکترونیک دیجی‌کالا فعالیت رسمی خود را با نقش هدف‌گذاری، راهنمایی و نظارت راهبردی و نیز کنترل مالی بر شرکت‌های گروه آغاز کرد و مالکیت تمام شرکت‌های عملیاتی به شرکت گروه تجارت الکترونیک دیجی‌کالا منتقل شد.

اکنون شرکت‌های زیر مجموعه گروه تجارت الکترونیک دیجی‌کالا شامل دیجی‌کالا (فروشگاه اینترنتی عمومی کالا)، فیدیبو (پلتفرم محتوای دیجیتال)، دیجی پی (راهکارهای فناوری مالی)، کمدا (پلتفرم خرید و فروش اجتماعی)، اسمارتک (راهکارهای تکنولوژی بازاریابی)، دیجی نکست (مرکز نوآوری و سرمایه‌گذاری)، دیجی فای (ارائه دهنده سرویس‌های جامع برای کسب‌وکارهای اینترنتی)، دیجی اکسپرس (زیرساخت و شبکه هوشمند لجستیکی)، گنجه (زیرساخت فناوری محور لجستیکی) و آپتایم (نرم افزار بهینه سازی مسیریابی به کمک هوش مصنوعی) هستند.

علاوه بر این، دیجی‌کالا جت (پلتفرم خرید آنلاین و فوری محصولات تند مصرف)، دیجی استایل (فروشگاه اینترنتی پوشاک)، پیندو (پلتفرم ثبت آگهی خرید و فروش اینترنتی کالا و خدمات)، مگنت (پلتفرم بررسی و انتخاب کالا)، دیجی‌کالا بیزینس (راهکارهای هوشمند برای خریدهای سازمانی)، دیجی کالا مگ و کارخانه محتوا (سرویس‌های مرتبط با بازاریابی محتوایی و تولید محتوا)، دیجی پلاس (سرویس اشتراک ویژه مشتریان)، دیجی کلاود (سرویس مبتنی بر فناوری ابری) و بومی و محلی (پروژه توانمندسازی کسب‌وکارهای خانگی و روستایی) از جمله سرویس‌های اصلی هستند که توسط بزرگترین شرکت عملیاتی گروه یعنی دیجی کالا، ارائه می شود.

اکنون کل سهام فروشگاه اینترنتی دیجی‌کالا (نوآوران فن آوازه)، متعلق به گروه تجارت الکترونیک دیجی‌کالاست که تمام یا بخشی از سهام کسب‌وکارهای دیگر (فیدیبو، دیجی نکست، اسمارتک، دیجی پی، دیجی فای، کمدا) را نیز در اختیار دارد.
            </p>
        </div>
    </div>
</template>

<script>
    export default {
        data() {
            return {
                
            }
        },
    }
</script>

<style scoped>

</style>